app/views/questions/show.html.erb

		<div class='vote_stats'>
			<% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers"  WHERE "answers"."question_id" = $1  [["question_id", 1]]