app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "slkfjlsdkfjsfsd"], ["commentable_id", 9], ["commentable_type", "Question"], ["created_at", "2014-08-09 15:05:17.147777"], ["updated_at", "2014-08-09 15:05:17.147777"]]
---
	def create
		@commentable = find_commentable
		@comment = @commentable.comments.build(comment_params)
		if @comment.save

SELECT "comments".* FROM "comments"
---
	def find_commentable
		puts params
		puts "before loops"
	  params["comment"].each do |name, value|