app/controllers/questions_controller.rb

INSERT INTO "questions" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "B"], ["created_at", "2014-08-08 22:05:02.158870"], ["title", "Q"], ["updated_at", "2014-08-08 22:05:02.158870"]]
---
  def create
  	@question = Question.create(question_params)

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 4]]
---
  def destroy
    @question = Question.find(params[:id])
    @question.destroy

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def upvote
    @question = Question.find(params[:id])

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def downvote
    @question = Question.find(params[:id])